
&НаКлиенте
Процедура ПереченьУслугНоменклатураПриИзменении(Элемент)
	  // Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьУслуг.ТекущиеДанные;

// Установить цену.
СтрокаТабличнойЧасти.Цена1 = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура1);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьУслугЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьУслуг.ТекущиеДанные;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;

	// Установить цену.
СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);

	// Пересчитать сумму строки
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура СделатьСкидка(Команда)
	Скидка1 = 0;
Скидка2 = Строка(ПрочитатьНаСервере());
Если Скидка2 = "Особый" тогда Скидка1=0.85 //25%
	Иначе Если Скидка2 = "Постоянный клиент"  тогда Скидка1= 0.95 //15%
		Иначе Если Скидка2 = "Новый клиент"  тогда Сообщить("Скидка новым клиентам не доступна")
		КонецЕсли;
	КонецЕсли;
	КонецЕсли;
СтрокаТабличнойЧасти = Элементы.ПереченьУслуг.ТекущиеДанные;
СтрокаТабличнойЧасти.Цена1 = СтрокаТабличнойЧасти.Цена1 * Скидка1; 	
КонецПроцедуры


&НаКлиенте
Процедура СделатьСкидку(Команда)
	
	Скидка =0;
Скидка1=Строка(ПрочитатьНаСервере());
Если Скидка1="Особый" тогда Скидка=0.75
	иначе Если Скидка1="Постоянный клиент"  тогда Скидка= 0.85
		иначе Если Скидка1="Новый клиент"  тогда Сообщить("Скидка новым клиентам не доступна")
		КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена*Скидка;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Функция ПрочитатьНаСервере()
	
Тип = Объект.Клиент.Тип ;

Возврат Тип;

КонецФункции


&НаКлиенте
Процедура ОтменитьСкидкаУслуг(Команда)
	// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьУслуг.ТекущиеДанные;

	// Установить цену.
СтрокаТабличнойЧасти.Цена1 = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура1);
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьСкидкуНоменклатуры(Команда)
		// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;

	// Установить цену.
СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);

	// Пересчитать сумму строки
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтог(Команда)
	
	Объект.СуммаДокумента = Объект.ПереченьНоменклатуры.Итог("Сумма") + Объект.ПереченьУслуг.Итог("Цена1");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
               Объект.Администратор=ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры




