
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
Объект.СуммаВДокументе = Объект.ПереченьНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
Объект.СуммаВДокументе = Объект.ПереченьНоменклатуры.Итог("Сумма");
КонецПроцедуры 

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;

	// Установить цену.
СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);

	// Пересчитать сумму строки
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура СделатьСкидку(Команда)
	ЦенаСкидки = 0;
	Скидка =0;
Скидка1=Строка(ПрочитатьНаСервере());
Если Скидка1="Особый" тогда Скидка=0.85 //25%
	иначе Если Скидка1="Постоянный клиент"  тогда Скидка= 0.95 //15%
		иначе Если Скидка1="Новый клиент"  тогда Сообщить("Скидка новым клиентам не доступна")
		КонецЕсли;
		КонецЕсли;
КонецЕсли;
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена*Скидка;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Функция ПрочитатьНаСервере()
	
Тип = Объект.Клиент.Тип ;

Возврат Тип;

КонецФункции

&НаКлиенте
Процедура ОтменитьСкидку(Команда)
	
	     // Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;

	// Установить цену.
СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);

	// Пересчитать сумму строки
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Если НЕ ЗначениеЗаполнено(Объект.Ссылка)Тогда
               Объект.Кассир=ПараметрыСеанса.ТекущийПользователь;
       КонецЕсли;
КонецПроцедуры
