
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Заголовок", НСтр("ru = 'Барбершоп'"));
	Параметры.Вставить("АдресСтраницы", "http://lesorubbarbershop.ru/");
	Параметры.Вставить("ОтображатьКоманднуюПанель", Ложь);
	ОткрытьФорму("Обработка.Обозреватель.Форма.Форма", Параметры, ПараметрыВыполненияКоманды.Источник, "ОтветыНаВопросы", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

//https://its.1c.ru/db/answers1c#content:1152:hdoc //